#+begin_src sh :results output
near call dev-1688110251604-15724842916349 purchase_premium_ticket --account-id eamondev.testnet --amount 1
#+end_src

#+RESULTS:
: Scheduling a call: dev-1688110251604-15724842916349.purchase_premium_ticket() with attached 1 NEAR
: Doing account.functionCall()
: Receipt: 8HGsdzRxCpJfjdL1mNZnDvSstNMPyEww6zdfX9NCZbvd
: Receipt: DHWYvPm3MkYFRaZopCuoTmjuDS6y6DxSxv3KAnP7q764
:   Log [dev-1688110251604-15724842916349]: failed...
: Transaction Id xT7qPtY3oamjiPEb2VqXfYvFnKirnDYHaKBJcTgrBD9
: To see the transaction in the transaction explorer
 please open this url in your browser
https://explorer.testnet.near.org/transactions/xT7qPtY3oamjiPEb2VqXfYvFnKirnDYHaKBJcTgrBD9
: false

#+begin_src sh :results output

#+end_src

"U2FsdGVkX1+WSeelxNBGZG6AvqLS+mIN9BWdVO/cJqEsOYAuyR2Ux0aPCZlBikElYvtJVaXfarXRFXY6mdvhNgtvSUEU2aZnvNkazeWqypictmSiTKGCotf0YSydssyC0kfXWGe6IZbyEl2nCv6sfdpz2H2IuTK3y3k+thS4D7/FtyuffudMkzFPr0+7h1hWZblkOUINyA1D88GI9AIhig==",
"U2FsdGVkX19GYtpCzCevqzBnyJ27V2xDp8o2+oaEpExk0B/VeSPlKQFKENXqOWhzqDqfC/6QtLCSPJHWWQvxH3ibBySInspGRyMFux3Nut/SCVPXFhGfBO8tmZ+zq6aRoPt9G/ter+4n27Yngz7s5oDwWQJzKPz1ZaVX5FdurEfWILInhNBpIRk6BtgRyVuYSLuKZJhkpI4fg4ukQtI3/Q==",
"U2FsdGVkX1+m30xWJqdgTx1s95z8VKTIpLkPdL7jla05C7/5CVZN6VilmwAp1Xi/52+442zYQxLdFbsNR9URu8IhOBtTdNAyB23dsqK3es5lEL4yEwkbaN7ZSXrnf4EZXOpovzdotyEz/6QRuWeRW53KAvamVGZxy1oNm+xV4ZZlNY4Gkz3+4eAnaykcICzO",
"U2FsdGVkX1/ZKn4WQV+EZyEtbwoCGG86G+xtspDQ7Jdyh+14V6SV8HaiTZiWGnCknZ/d8basEMT+Zb/Ma8N1E7Q20CWrGkzHYPXgt+w8zYCAr89QkdfpDadaF08zD0247kd0eFQFzKfkYMUmVFTDixHUvqoZ/zM+DG+kumGYGR8fsPSpOOH5mZqdF+xBs1fq",
"U2FsdGVkX19EJPlAlPrgPgNkUuDScBP5cXFbihAsopg9w2D8uH5JroFtJIIW+9xW81oc6bd36RxuSOUS1jVhGFAt5U9g64+YXBSYLIG+fe/b7m0livcphEQ7+YOnE2Rdf45kHoSLk2l8/6LDNp5sU4vF2HAZhyiwMnrS6iYotuOT7SRdph4O4vZ4+0wqXYk+H29QLJTqaqCB9ltnfZr++g==",
"U2FsdGVkX19MxoZz9y/dlC0egfPyqLYDAYoG6FLl4Ndy8ba4dlSijGWPtnPFLeQ4tZAEDQz1qPYu2VTR2qpgTBkA5Y8zXY453z/gacpt2qcTiQ32eJZgu5X+xSFVMRHPyQpg7ZNOApXPwAU2z9U1p6Wf20ybx4BgtSxmcUJZheswMtnxc4z81W+3ZBFaZrND",
"U2FsdGVkX19by85QSCaazhObNjvUFX1IdKzuuLZmTZsSYQ6jvrPMgqaoFy53eJ1IoNjAOwBS2Mrn/nis6iaZDgn8Te/oS8HRK9+ONFeOUHiUA0IhjONUmV895+OVVREHRo8eWjzEesvHnLDeWuWnVZzUCJ5YKwqxOnRxifMGPwZg9jOYbXjcg4ivH0BH4FZ1QIV75fEqKM46EOjrXIZrSg==",
"U2FsdGVkX1+ZLTNt90hRC3OzdUwhqdgjBjEW7BcQ8CZ8GCT54JpIKXYA0ef8vnLwlbbr2YiT+7+0XIenUJaFig81KbPeQeHu1t0nVtCmMGLWSwkeavR7w0aoIw4AQXVIdKpq5/P+/5Ypjyw4EX3yDgqmqwXR42Q+jo8s22EMp4TwC7u1tsWqh2z6LMaIKbzz+Ay3UqhNsjd7wOcprDOKiQ==",
"U2FsdGVkX1+zabe4ekbP9zW+YYhwIbzgniZPa7uPN0BhP07xMP25SKOQVkUxVeJbmASGp9NYKom+hOqSd+XojUpsWegLY2DUCpEzjDMV6POfkOQAdwd/WiQ/aFPLx36uxg334TahPqjlDEZ0PSkrOJYmH8iyN9BnX0MRlNU2/EX2nW25/RL2aUvF9WVfcHE7sOfW4Dlm4hfcbieORE+eAw==",
"U2FsdGVkX193ptts7z1Xp65X59puB206a3MCCs2aPoInD0qwfj9KqNSeUIlx0CDBKH8+C8cMMp1ZOfuaNSm3mZY2eEHEa1g+6zNN82zQhL5qWKdrTB5+NnEeVRMtWld6WdnGMRkibpeSSoGRQgUgp2TLk+aTPy1OVQgB+KHwFtr2EcXlx7yicLiVqisvepL34KWGhznD0AUl/EtRdQ0c/g==",
"U2FsdGVkX1+q6MSVV9+lxPvF8pQglk9L78JnPO0H4ZFhHiuMb/f6vKsNlFmnTIBMuijc2bBy3CeC7vA8SCqCUEgKHmu/tWmc/mZL138R7xBFBw6mSlEvPPu1/Lz6WsB3M+uUWjb5t64bsW15KEsV5wJ6U8uCi7VtVacjm+dY31I6xjamrs0SHnaZhB/bwXo1n+2Emmrz/nwvzRS9RZQOKA==",
"U2FsdGVkX190LxfqW8PaiYHdxBPG6Xn6wIKWOJj83lB+cAW5YIk+YKqIAgBAF7xnntmDXk2WBjE/Pg1Zkl5l4tb/aRv/JVKGsYstCMYPqE1QsOtW6dpj/HLzITqp624vTk+eLhalXFnSM/24ZzAzq+7Owv1pJuQKIzfkT5ioTx9/moLqoEw50wzP7/v2hDPqJj5VTa3nDrzrVUVxNZz2Ow==",
"U2FsdGVkX19CXHYXZlsYuWk8DJVTaF1WxY17xNIS3+1Wefj03LxFqp6B7yD7PIbjzrv6yKTXFAOkoj2dq3fRdkgWNUsjfL4B4OqngGuUZgamvkYVSj/at508Wa4DBtjM8LMCW6+B/sr7yjTWkEdsG1XUTvDgoZd7W2nEIdQDWhpUFD2ocJt0dW77n8JckbIc",
"U2FsdGVkX19MwRlFr34h+rS1uNBeFNHbESZhQZMkadxM+cYg1oWTudk3wiNUSDoVE+UUqVpHgQAem6lmc94+6PcTmBBwe2S32h6PeefmBp0QzRFmBHe9sQVsSXpTkSA8sOJ6vGN7UpXxPVOP4q/+WNkzUQNg5Hr2iFleCFmIYYVL9dg1yHjnuvasXrzHSw7Pzibtxbdv1GNRYUclclGNmQ==",
"U2FsdGVkX19J8IRSFn4iq3W6OVbNiAqBDqi1juPnIoe1XaIHiMJv+bSPc3qsGBeeFVIbntWW4DK4ftZA6WbwejiQAN8qKpIwsWURmh3WYFUZUQZalSYyGgHzvaGUYdOVStfBXwEHuAi02S25Feo8onJXgcW9to+wDkViZADxXf/NmVk4CpyFoKlPqUYhyK4x",
"U2FsdGVkX1/8UVFJKLwSDx0oS0agbTFTUgeG0lT++AhTjfNDHVlhg/1XM1rcnXy/rA1D+/+beo2CzsO8Vyg3OlZclNFSBYOBhnyyXc/PJinRR25g/6r23XRvJGWsnol7WgoL0aUBsytOdWxLsk7fBEEOU1tNTFykMWjKIRhcUkMlZJaj+NdNPARlNWTVINl0",
"U2FsdGVkX18OT3tgmtMju+2s/CEFroGDcckHPgqviMY8mkLaOXT+OsQvuecwHxgT6MQxfC7IOobyck/O+tqEQDrnJ25LGtsBx6wuPuUSmo6Y3IN7Bt+aQlWhhQNMOYdp7fD9YacSgOLkEP9SxOzF22Kaw2rucrBEuCyXsiT93/M9x8JJbmfGxl7+DnZhJN5Hb+9abdBQFRLl+N04+Zw9ZA==",
"U2FsdGVkX1/5LpSxZz0vNPiwsg0+27D37vYTs9mjScZxyyZQCkjBVSt9cVW+2rKC+Esm7rnUYKpKMLR+CGsm0ltrc6Smjv9ypzpCiBzwW3x9ciNDWr+QbAhhLXBaPAiJH0JHz7kInaVshzJE6OFEEAXKFZrx2wFnmGOU2L760HzRt3H1cdnxaxmByOOdjJewjyfrUf6OYVhHwuOjqWEzkg==",
"U2FsdGVkX1+wx1T0rAZXL1yv+4uX7rK2K3GXXkprrlIwKDlHjItGOT74fDA+CmbKDsNfG+LrPaesxkEVZCykH7HoqZg7GbeG2bc9GGx2LaP27vmWJ7UgrXfUwymAsJVNQ4V7MC5CJkkbp3dOeDuDeFIHUzYL2BwgI/vHi9KjX/S8ksezYCznYttKV8uuqpQ3064JhtJ5Iu7t2o7Yp488mQ==",
"U2FsdGVkX18aDbD4ILN7zxWUOWSb27VPKCt80/Y5s1MpAWBN6kKug8mHwci9wej81iT+JSV0MJooUZ3UJEKKpawHxFAwXtPk1Yzg8ajtiJHP8D+53TCPWQq0ryKUR//AAG/HD5TXhyMJYFpZnSf1/8UVZf8bc0KxJI8Ok79NSWwuE3OQ5dGWY0UoChgeC5uTGNYIpVbn8KivlkxzK/CwVQ==",
"U2FsdGVkX1+uwfC15W6aOX1Oy/0xM3oih+cIwIezWtJCJGoWHEcbITVl3ipr2qX7ItKppWtVEJqAOZEVXb+SY2c10TDJcqPuRWw7wTbuFyn5XKm1EBmLYeQT2CO84Cy5avc6ElcfFy01/PB/rtkXNWoEO6cfiFJN80IavJOUh/Y54dGQa5YLn21e8vYqj4qGubIKljSW/dKc/AyOtxV8Dg==",
"U2FsdGVkX193vL7I/k1cu37IuQn+eGsY+8k2u6ptJzsRvOZ3ncHXe3JSsOH6Rr5MaaZKeWO/d5diEQm2tIDr6Ys1ehTFu9YHv+o/vGODQx1C++6F2JCznz/yycXWAjn8Wm0ys6ytCuDlX+HkUBBgKBQHZf4c7aSSCX4c2BC1JQl7138IKZ2onGGsEQ7FZRjyJwf00DvSq56WLXeaHP6zAg==",
"U2FsdGVkX19KjiBG2rnm5ah/2/OS3zr8ciRilGKs2jfvc47Uytwtsn+M9QcQjR1uvetclcgikTCOKNjU9fzPBzlWrF7PVCsFn60sWCBDi6ZvgxG/NjaGfENZ7RnmDUDprxqr8lKOAHzJNMwx/hOv9ROBknZS5OkiqbL9+SG2nu9t9VaiUrTCCpQtJ9rTHf+Y9wDWTUUPNH+hEzkXXZ+Lvg==",
"U2FsdGVkX18abMbB4Bt3MTjF7pzVaL+f1Qn1DiZL32Udctyz7QW2RajBpaG+7PCtr8jxxNl7+CUBN+h86bDM1m/H0Fhhl51rUYSPzmRag0luGCPJ6t8nQHwbc3aTXcMYQvcZg5/CBdHRF51813pvM/D2m0vnTeOVjYaQQ5lLOoWoSlI9MZhWh3isfuCtqZnR9yD9SBMNIIhhV3F+gHjJfA==",
"U2FsdGVkX19I75kfR4YTNfGp9dAvO9GQ+O/gcba7oSFokPyeaAnPoNX63seubCfL07p/gcOsQE4XkoHofzfF4Kig7OfP05j6k+9iPzcYoOQRCj1X7g3waC6CsU62X/aa9l8ojCj7bNApaans171ObNasAXuuBx96WnP0KbEoJWg5+zEn74FkkgQ58yL7UIEkoemUcxEHSvoamPO2goaiPw==",
"U2FsdGVkX19fafRhpyvXLHPw9u2gfNO8UJNWE26ZdSABviorZnsyRpNSe8BEYOnD9z+q6d9c8yFbSTEQ1MnbzWXIZ5tlCwC0f4TB7sUumrkFYbylN23fHX+/YJ8F45ksfxad9A8NxexIKytYUb9iENogR+kveeBUCSFSZqDIZ3Y79b18RGGA5UfsaLsQPGlW",
"U2FsdGVkX1+oVr/+S9fDbfZ8swEjsxUA5Hs3c6eZNh1hXCiMyR0ytNlsIVPcxYePF3iAD22BehBgYpZ9978D7tCHwN4TwjAk9KKGJyzGVKcAdk86GxrQuxWsfnTHsoP1C2vSa0VQCjKFzUW71W5MD4VpIsPiKPYIFqxn8gD4aIRtz30iMSCbSJRNHAtQz6wI9Pef77giJbkQNwrRofsAow==",
"U2FsdGVkX19mWuh8ChnI8wvxLfxzIjYX0WaYXwWHcUMvcQ7UA1gozrzqknvzIOElLA32fN69qYiuI3/gqm7c7Js34hiDVhxddbELSAAgD5aZ2u2/ETnpc8JFnAwqEKM+1qgjWGOJ8A+XeKe/2yBxuq1KDyBbtMjrBMmZr/4XuywOrnUUx+bD6CdGsbI18o6v",
"U2FsdGVkX1+/9OzMrWChBWUhwuYLKFvbxaGQeuv946VNdoNulwBmrpC1Z27nP8p3MMT+UPOQVa+qVOYAIFkx+7gUAzoEY3y3q56tB0dR7qUMN7l3GWuOfe4FdNqTwqcM75UcGUnWytRljZgAZAWKF/Wr5KVmpiwdXPaIowVVggKQxo8BMqWVPNilYME+KNYdOCgDrFpMF146UtCndI/akg==",
"U2FsdGVkX1/SkHhAo9kBW3Fql77dVZ7fHVkjMQI4UNJ56RdPyesEUo2ZFLvT0mNdTfpWqx+sdPVPzpej646eSnKIVH+pS2mFomqhooB/18+fwgclIIGnMxEk5Yoci03RIH50B8SeI2EfMVoxE9XcKixUfpHbQtK9pf1izJ7vXmc5qGLffleTEgAtaIMqQhL132hdnXGwi2xj58+wZyeGNQ==",
"U2FsdGVkX1/K2fYCPTyOushK7Ubvrlzny3vciAyF9gWW+JFIY6mwt4GAcWk8jBaknS5lo8a0byMfVK+6NxmHZaKqpUUDnFT087fAJfQY1b0W5ypTV6Cf2JWkxLNRrDVB0v1vvVInO03zwgToyATHAc0DM0/Y5b/u2wykzJg5LZU/lR8ApGmrDZPfQmH0rKJexj2UA7vo6vD0h98ugiH0mg==",
"U2FsdGVkX19pPRpviSdk9jUyoWrcPsI+R4JxgCtt9vX2H3a5v3C5ih9tGHImhjoMJBGpzCsYo2u34NPS96aXbZfiIHUI8M5G55zcGtu/Bpahk/gab0UWGf0dGk88oKNvqU2LJeq0Ny3Mjkh+57PezbjN5mPC/7c1kK3s3OaFQIbK5uNgLNbqHdmjto3SbR5GM8dCRqT/V78yZqRgPYzZrQ==",
"U2FsdGVkX19lJGQdTxxd/OSyhsRBrWH7hFW311LHkEffoCzIGQQYbjUtbi1447S7TXUbncKjq7DOHHyh2NOaIQulNUscG0z6eSQj8HwSQe0L735f0skhxbh+IrwQCmZ3hdAzMVLsFLrT2L4nh1uqKYYe3WTY+1KRCAqS4T3mvzB5MeRyhdhHhjkEhG1Yvn+YpQrU6z3ih/mVoc1pA++Q+w==",
"U2FsdGVkX1+7sl9wL0r3iOJYcfsi/6Tdq3/Le1Zp/0+mPpAf7Poxw0HEPGAsgzswrJ33/JqpBMi61nslXyspvwkHjl7+b+nbh8acm3EL6+qEy6BF4qNQC5iZZ91WEHK0vq6ucfChpwwkcUAm5qXnf4Tc9yJMTRkcmBmSwWlggOu/5xqvD77r+jX9WZEGPSWEd1gRk96/4/Tt1mO3crVeKg==",
"U2FsdGVkX19/aI0AlAINPMi+tp9yBAa7mWaYjb5kJgD+Mk+zY6R7xQUTomdac0UqGZXorrsDS1ZTrDBGqmeYEaMSCABva9QUk/lN+7H6FOpUNxXhprBMwudcb7Nba1JwYRR9pCqYu6q+pSJHH7eIpyCzvOAWaSvVizc/6O3EtcaYonJu/m+R/Gc4MTLED5ztyl821+jzBXM+oPlmn6Wk5g==",
"U2FsdGVkX1837Ym4EWFasDr9+WCB+8ez1QbGHYPdFJFzzeRLVWiQ9JbSLxgW6B2O/TYB16F++/NDx2gOL6+rseaPbO+IcFg03Zay+verUYWqJ7JD0eEO7EUJo+SP+rU4lu/4F1MFBxC8Oh0CD54DjTzaZwIz2um3xFCZ0/I/pMf16j5LNix7HdCnjfPv4t9cVv3n4Xgq8Zdtay4cjOh4Tw==",
"U2FsdGVkX19h2qGu17o1mWGtX3m3H6/4XQVOy7yJ3dy4l1Juk0NOnPI1NXnriD7TDnMf90B/ikwxmIQEH8MgWRN/8bjTfIawv4rvokA5hizZ4pEuBz/+H0/W/LfNQvFdYO2wYz2fYO6cKqJixXnq7AbH6ev/5tsceJkYNHpKPyr3UuRJ7Ro1Y2bzGLSVxBwl",
"U2FsdGVkX1/DRBfm16PjMAuggXSkVc9HcX+aUSEva/XfFL5QFDmKlpikniweeVf/OEVBBYuQJ6KduYmTIgnOqgFTqzBybVLhjuW6cUyieqwCYltYZGH+P3NcVvKccX1aWxe+vkK5xhErCFuWAmwOZSMV2DyJJcHJnEm3iRc8RaNGDYc/AFlb/u+Fd+0dgKsD",
"U2FsdGVkX1/XRJT7uGCu6dihn011nrUgMtRVAXWN4yJl3tFFxk79XYRtsaPRs8cYhRfKmw0P25j8xrhV9BlOwNltP2ugH/0fNcYGoYsXAVcSuQh7vCRoP4WqzohmlvuPCgaBOTKN26zcRJmwmLgwJVPwGoHK9+YhzHQ/KuCMwISP/FU2EH+AgcapEKZObjFQ",
"U2FsdGVkX195qlJHXMX411DaOoU3jXdo0FkbaDagzmkU9pzqdI+prNtciTfjcrhgHtILWIGqHnl7eHZdgdZJaIiGTX0m0rlqEe80scN0+K960JEhAE8rqZMrmCWwGNIPOSvD1OoEReNBdbfMEqOOMYt+iW4Kz+E8b+WOy61jkLEixI14zWjJvNXCd/GA5EPc",
"U2FsdGVkX1+7o38xDdiKybORwYTMTFU8N8BfM7vG5K5S7D5Y/T633V6g9A5ICF9Y8enecPPO0iWabYLXCvFxt2/ikRA1a6UZpFfS1wgOPIsAcouPIfn4c3N6/VF5/eHIePgfDH52pAea3p+kGaMV8cDeOoAwp+Co65U8CTsBCPxfLDWLMTpETPgE9RM0zQqMM6Ju/LzDwIsIskJRZX/eew==",
"U2FsdGVkX1+W+sWl9MHmb9DGjN2Wx7WdbYNId/FyCgfZlBjOHSK1iflJQZ2Vw1X2+aRdbn6XTv3WNqHYhTVq3RsMsQOtUyF6U729oMzaMad7tRnQUUMGDdEIHGD6aCci//nVnoMfJ5USA+LywiyZb/xObLBj5sMLhJ5IRUetsP7SDi5VfjV5WGvXWqRfCETRrxZn44J4IdVopu/ZA8tR0Q==",
"U2FsdGVkX1+p7ZMOrM2GePmjM7WH0hKsbb03i4bPd8rGim7CeUo4OrIWOSjpdrXk+Ptvps/Oi3y6+ayl5dUA1e9rP3W05IS+yHYS43/NkCUQhMU09r/qPJdhBIq3zio01h+SW+XJCgza6etbfEGv+Kjg7O6zVBc7N4gL0lW8lZQqkjZ1w/9YO3IVttbDvACqe4ULwcy81A4mc9s6OFoYDw==",
"U2FsdGVkX19OyENcgvQ4txWJS/vMAegCKg24w+fOWfyzIv6A7xMDyzuHwR3DwAs641efvEErji35FdpjEF4x4WuRizSmImOWs1U6rlJJmWOy1UAmMbZF4Y3yviHMb57AeNeldzM25VkAbnjHx/yYystASDLSjoRZxA7by4ifn0vJC55V8FeFpmv0nEIdmNWB",
"U2FsdGVkX19Z07tcAKWQRcA+w/M23s8n3fLNJwR1NZF9QwbcXo7sNXdgWgNlH0sIQhltvQ4M7Lr1A+jbMt+gvaZF9rnrl20T4ss5hpxqToQlAJQ19QKch4VouWayjrSUzuKaEGowGDr038+cuOFdcJsZkgBlkge3i45/zKt57vVUUvVSqU5Chv1RQWM+wz0F",
"U2FsdGVkX19fqra3kSOWb6L4i7k7mWzxg18crqCdu1CIDaklpe3vanfglEQu6E+Jj4yIdO3TguGifRlJ5J8nWNOKfY7DsmAVTT6B8Pzs/arrIWB+pGCMu4k8a4yjXPXaISLx7Ocoy9J28/A+BL2R2+30dOFZGwkzgcKuGccg343c7carvO+3TszqpHh9nExw",
"U2FsdGVkX1+rinGjRTXEmLemLvJoMmf/jvPkDygZfmhJ1ydRly7MF3PCE9YqtTyGZ6ZP9xzzrfk3eUT+xcHDYa2fzsR+hT+zy/ycnnXaJv/V8CrYW51x0KAYZqSwNDsO1+KRCsvwCv9Yjoc0jMGGcumbvQXb8pCVK8lMJG8giGY9Ml5R3qW9fQIMaxl1AQHu4J3R66AUxFCJpACKLDM46g==",
"U2FsdGVkX1/eHm0k41MfSUQAtUi8r1KLhdw5HVCZBzHhs36HNqtoZIXunxDrPnvIU0Szk3VlEnfOjwTaAcpIoBLIcj4GcUlPgC3twfq18pQihfFkP5m1et+1RAILVRNUELl4BUxtEEBl2iztkMJfocM/gptfXvfp4rcshr1cuQQEk5fS/799JDZo0JgwqCq4uu/CoEBZFjrsH1A8VhiCKw==",
"U2FsdGVkX1+G7s2IRdy+40YCWnbXUsUV7w4LtpXo0feXzFIdcSIWIhnUcMLkFOqd2m06Xp0ToVSZLo08nGNHhF2d5Y3twtClhSFNs8nsNJ0LZvxwIUZ0Rvux+UzcTgsjDHCbCRRPRTi+dl/Rt8AnK1uyis5zeHOPOl40YrIMH9DmIVg3utFe+UQY4CAYLNu8"
